# GetMeshVertsCnt

## Description
Returns the number of vertices of the passed mesh handle.

```pascal
FUNCTION GetMeshVertsCnt(hMesh : HANDLE): INTEGER;
```

```python
def vs.GetMeshVertsCnt(hMesh):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hMesh|HANDLE|Handle to the mesh object.|

## See Also
VS Functions:
GetMeshVertsCnt
| GetMeshVertex
| SetMeshVertex

## Version
Availability: from Vectorworks 2012

## Category
* Objects - 3D